posts/2025-01-21-moonlander/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Moonlander's Curse</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Moonlander's Curse</h1>
</header><p>
Five years ago I bought my very first mechanical keyboard, a <a href="https://www.zsa.io/moonlander">Moonlander Mark I</a>.
I didn't know anything about key switches so I bought them based on what sounded
best on a random review video on YouTube. I sometimes chuckle about that
decision making process but overall it worked out pretty well and I am happy
with my purchase. The only "problem" is that owning a fully customizable
keyboard is that it's fully customizable. Let me explain.
</p>

<p>
So the Moonlander can be configured using <a href="https://configure.zsa.io/">Oryx</a>, an online tool in which you can
specify which key should do what under which condition. You can find a decent
amount of layouts by using Oryx' search feature or by looking through entries on
<a href="https://people.zsa.io/">https://people.zsa.io/</a> (such as <a href="https://configure.zsa.io/moonlander/layouts/rXlOQ/latest/0">mine</a>). And this already outlines my point:
Having too many choices can be an issue on its own. I love my keyboard but in a
way I also hate it, because I can make it do anything that I can think of. Want
to simulate a mouse? Sure. Place your modifiers on the home row? Easy. Want to
create minimal setups using an endless amount of layers? Why not.
</p>

<p>
Tinkering with a keyboard layout comes with a lot of trial and error. You start
with a great idea, you flash your keyboard and then one hour later you realize
that your design is flawed and that you can't type something that you need on a
daily basis. Different "use cases" (e.g. programming, gaming or writing) might
make you believe that you need different layers/layouts for these tasks, but
then again: Are you actually improving your typing experience, or are you
overthinking something "simple"? That's the Moonlander's curse. I keep telling
myself that my current configuration is good enough, but every couple of months
my brain ponders the "but what if&#x2026;" question. Be warned friends. Be warned.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2025-01-21</p>
<footer>
<p>© 2025 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
